#### Terraform Plan 📖 `success`

<details><summary>詳細なログを表示</summary>

```terraform
Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
infra/environments/dev relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/web-daw-backend/web-daw-backend/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/web-daw-backend/web-daw-backend

To view this run in a browser, visit:
https://app.terraform.io/app/isb-ikenoya-study/web-daw-backend/runs/run-Lktd2Lb6qAULGAoS

Waiting for the plan to start...

Terraform v1.14.6
on linux_amd64
Initializing plugins and modules...
module.codegenie-api.data.archive_file.layer_zip: Refreshing...
module.codegenie-api.data.archive_file.api_zip: Refreshing...
module.codegenie-api.data.archive_file.api_zip: Refresh complete after 0s [id=49031e59f3e3298b9ccf39d5b07cb06761bd350d]
module.codegenie-api.aws_iam_role.lambda_exec: Refreshing state... [id=web-daw-dev-lambda-role]
module.cloud_front.aws_cloudfront_origin_access_control.s3: Refreshing state... [id=E3INN5EP3F96LR]
module.route53.data.aws_route53_zone.parent: Refreshing...
module.cloud_front.data.aws_route53_zone.this: Refreshing...
module.codegenie-api.aws_apigatewayv2_api.this: Refreshing state... [id=8usf1u2f1g]
module.codegenie-api.aws_s3_bucket.lambda: Refreshing state... [id=web-daw-dev-api-bucket]
module.route53.aws_route53_zone.public_zone: Refreshing state... [id=Z07777823QWN63F6XYQ35]
module.s3_front_end.aws_s3_bucket.front: Refreshing state... [id=web-daw-dev-front-bucket]
module.codegenie-api.aws_s3_bucket.layer_upload[0]: Refreshing state... [id=web-daw-dev-api-layer-bucket]
module.codegenie-api.aws_iam_role_policy_attachment.lambda_logs: Refreshing state... [id=web-daw-dev-lambda-role/arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole]
module.route53.data.aws_route53_zone.parent: Refresh complete after 0s [id=Z05552098SOY2YNHN5H]
module.route53.aws_route53_record.parent_ns_delegation: Refreshing state... [id=Z05552098SOY2YNHN5H_various-ikenoya.isb-bs.com_NS]
module.cloud_front.data.aws_route53_zone.this: Refresh complete after 0s [id=Z07777823QWN63F6XYQ35]
module.acm.aws_acm_certificate.virginia_cert: Refreshing state... [id=arn:aws:acm:us-east-1:374474405705:certificate/8809591b-ccd9-493e-99f6-7a0c6d0bfe52]
module.acm.aws_route53_record.route53_acm_dns_resolve["various-ikenoya.isb-bs.com"]: Refreshing state... [id=Z07777823QWN63F6XYQ35__42d33b35779d7766862cd281f522ffc4.various-ikenoya.isb-bs.com_CNAME]
module.codegenie-api.aws_apigatewayv2_stage.lambda_stage: Refreshing state... [id=main-stage]
module.acm.aws_acm_certificate_validation.cert_valid: Refreshing state... [id=2026-03-04 08:17:13.091 +0000 UTC]
module.codegenie-api.data.archive_file.layer_zip: Refresh complete after 4s [id=c6295dca63fadc21cbde10cf459e1c417437d582]
module.codegenie-api.aws_s3_object.api: Refreshing state... [id=web-daw-dev-api-bucket/api_deploy/f244d12f.zip]
module.codegenie-api.aws_s3_object.layer_upload[0]: Refreshing state... [id=web-daw-dev-api-layer-bucket/layers/nodejs-api.zip]
module.s3_front_end.aws_s3_bucket_public_access_block.front: Refreshing state... [id=web-daw-dev-front-bucket]
module.cloud_front.aws_cloudfront_distribution.this: Refreshing state... [id=E5443JXSUPKLD]
module.cloud_front.data.aws_iam_policy_document.front: Refreshing...
module.cloud_front.aws_route53_record.record_aaaa: Refreshing state... [id=Z07777823QWN63F6XYQ35_various-ikenoya.isb-bs.com_AAAA]
module.cloud_front.aws_route53_record.record_a: Refreshing state... [id=Z07777823QWN63F6XYQ35_various-ikenoya.isb-bs.com_A]
module.cloud_front.data.aws_iam_policy_document.front: Refresh complete after 0s [id=4167549089]
module.cloud_front.aws_s3_bucket_policy.front: Refreshing state... [id=web-daw-dev-front-bucket]
module.codegenie-api.aws_lambda_layer_version.demo_layer: Refreshing state... [id=arn:aws:lambda:ap-northeast-1:374474405705:layer:layer-demo-ikenoya:13]
module.codegenie-api.aws_lambda_function.api: Refreshing state... [id=web-daw-dev-api]
module.codegenie-api.aws_lambda_permission.api_gw: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.codegenie-api.aws_apigatewayv2_integration.lambda_integration: Refreshing state... [id=vct83m4]
module.codegenie-api.aws_apigatewayv2_route.api_route: Refreshing state... [id=qirrnga]
module.codegenie-api.aws_lambda_function.api: Drift detected (update)
module.codegenie-api.aws_s3_object.api: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.codegenie-api.aws_lambda_function.api will be updated in-place
  ~ resource "aws_lambda_function" "api" {
        id                             = "web-daw-dev-api"
      ~ last_modified                  = "2026-03-13T07:16:07.000+0000" -> (known after apply)
      ~ s3_key                         = "api_deploy/f244d12f.zip" -> "api_deploy/49031e59.zip"
        tags                           = {
            "created_by" = "yuta_ikenoya"
        }
        # (31 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.codegenie-api.aws_s3_object.api must be replaced
-/+ resource "aws_s3_object" "api" {
      + acl                           = (known after apply)
      ~ arn                           = "arn:aws:s3:::web-daw-dev-api-bucket/api_deploy/f244d12f.zip" -> (known after apply)
      ~ bucket_key_enabled            = false -> (known after apply)
      + checksum_crc32                = (known after apply)
      + checksum_crc32c               = (known after apply)
      + checksum_crc64nvme            = (known after apply)
      + checksum_sha1                 = (known after apply)
      + checksum_sha256               = (known after apply)
      ~ content_type                  = "application/octet-stream" -> (known after apply)
      ~ etag                          = "d0f4ba42e7b2d32e6446eb29e8b00d99" -> (known after apply)
      ~ id                            = "web-daw-dev-api-bucket/api_deploy/f244d12f.zip" -> (known after apply)
      ~ key                           = "api_deploy/f244d12f.zip" -> "api_deploy/49031e59.zip" # forces replacement
      + kms_key_id                    = (known after apply)
      - metadata                      = {} -> null
      ~ server_side_encryption        = "AES256" -> (known after apply)
      ~ source_hash                   = "CDgJNtywNioMXVDBMl5Dk6ciIVzy8K4zxU2IJQqZoeY=" -> "cNwum/noHY823pT2dOBprPt0mv7lMhiDrScbN+Qg77k="
      ~ storage_class                 = "STANDARD" -> (known after apply)
        tags                          = {
            "created_by" = "yuta_ikenoya"
        }
      + version_id                    = (known after apply)
        # (13 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @isb-ikenoya, Action: `pull_request`*